{
  "backend/main.mo": "Motoko backend defining task, user, payout types and state, with admin-only queries for dashboard stats, payout listing, and payout status updates.",
  "feature_evidence.json": "Feature evidence report listing deployment-related files, components, and requirement mapping.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose and functionality.",
  "frontend/index.css": "Tailwind-based global CSS defining color variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point loading the React app and setting metadata and favicon.",
  "frontend/README.md": "Frontend README outlining features, tech stack, and development setup for the Xtask app.",
  "frontend/src/App.tsx": "Main routing setup using TanStack Router, defining all user and admin routes with layout and auth guards.",
  "frontend/src/components/AdminRoute.tsx": "Route guard that checks admin status and redirects unauthorized users to the access denied page.",
  "frontend/src/components/AppShell.tsx": "Authenticated layout wrapper with top header, bottom nav, and main content area.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate handling login, loading states, and onboarding flow before showing protected content.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar for main sections with active state highlighting.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card wrapper providing blurred, translucent UI styling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/TaskSubmissionForm.tsx": "Form to submit task completion proof with validation and placeholder backend logic.",
  "frontend/src/components/TextLogo.tsx": "Simple component rendering the XTask text logo.",
  "frontend/src/components/TopHeader.tsx": "Top navigation header with logo, notifications, and support links.",
  "frontend/src/deployInfo.ts": "Build-time deployment metadata loader for canister IDs and site URL.",
  "frontend/src/hooks/queries/useAdminDashboardStats.ts": "Fetches admin dashboard statistics via the backend actor.",
  "frontend/src/hooks/queries/useAdminPayoutRequests.ts": "Fetches all payout requests and provides mutation to update their status.",
  "frontend/src/hooks/queries/useAdminStatus.ts": "Checks whether the current caller is an admin.",
  "frontend/src/hooks/queries/useCallerProfile.ts": "Retrieves and saves the current caller's user profile.",
  "frontend/src/hooks/queries/useTasks.ts": "Fetches tasks periodically and provides a mutation to create new tasks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and base styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders an about page showing platform details, deployment info, supported features, and limitations.",
  "frontend/src/pages/AccessDenied.tsx": "Displays an access denied message with a button redirecting users to the dashboard.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin statistics such as users, earnings, tasks, and handles loading and error states.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin panel layout with navigation sidebar and header, wrapping all admin pages.",
  "frontend/src/pages/admin/AdminPayouts.tsx": "Displays payout requests for admins with controls to approve or decline and handles loading/error states.",
  "frontend/src/pages/admin/AdminSupport.tsx": "Static admin page showing an empty support tickets placeholder.",
  "frontend/src/pages/admin/AdminTasks.tsx": "Allows admins to create new tasks and view the task list with form handling and validation.",
  "frontend/src/pages/admin/AdminUsers.tsx": "Placeholder admin page for future user management features.",
  "frontend/src/pages/Dashboard.tsx": "Shows user earnings, task stats, and referral info, with loading states and clipboard copy support.",
  "frontend/src/pages/Landing.tsx": "Public landing page with hero content and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Notifications.tsx": "Provides a notifications page placeholder with no current notifications.",
  "frontend/src/pages/Onboarding.tsx": "Handles initial user profile creation with name and optional referral code.",
  "frontend/src/pages/Payout.tsx": "Displays payout balance, minimum withdrawal info, and placeholders for payout methods and history.",
  "frontend/src/pages/Profile.tsx": "Shows user profile details, referral info, and links to settings and login/logout actions.",
  "frontend/src/pages/Support.tsx": "Support page placeholder indicating upcoming ticketing system.",
  "frontend/src/pages/SupportThread.tsx": "Placeholder page for viewing individual support threads.",
  "frontend/src/pages/TaskDetails.tsx": "Displays a single task’s details, status, reward, and submission form or review/completed messages depending on state.",
  "frontend/src/pages/Tasks.tsx": "Lists all tasks with status, reward, descriptions, and navigation to individual task details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and manage persisted URL-based state.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, layout settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s scope, constraints, features, and architectural notes for an Internet Computer–based web app using React and Motoko."
}