{
  "backend/main.mo": "Motoko canister defining task, user, payout, and admin data models with admin-restricted dashboard and payout management functions.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Lists summaries of all frontend components and pages for documentation and reference.",
  "frontend/index.css": "Tailwind CSS configuration defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React app and favicon metadata.",
  "frontend/README.md": "Frontend project overview describing features, tech stack, and development setup.",
  "frontend/src/App.tsx": "Defines TanStack Router routes for public, authenticated, and admin sections of the app.",
  "frontend/src/components/AdminRoute.tsx": "Route guard that checks admin status and redirects unauthorized users to the access-denied page.",
  "frontend/src/components/AppShell.tsx": "App layout wrapper providing header, footer navigation, and gradient background.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate handling login flow, profile loading, and onboarding redirection.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with four main app routes and active-state highlighting.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card wrapper with blur, border, and shadow styling.",
  "frontend/src/components/LoginButton.tsx": "Sign-in/sign-out button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/PrincipalReveal.tsx": "Displays the user's principal ID with show/hide and copy-to-clipboard controls.",
  "frontend/src/components/TaskSubmissionForm.tsx": "Form for submitting task completion proof with text, optional URL, and placeholder submit logic.",
  "frontend/src/components/TextLogo.tsx": "Simple component rendering the 'XTask' text logo.",
  "frontend/src/components/TopHeader.tsx": "Fixed top navigation header with logo, notifications, and support buttons.",
  "frontend/src/deployInfo.ts": "Build-time utility that validates deployment environment variables and generates deployment metadata.",
  "frontend/src/hooks/queries/useAdminDashboardStats.ts": "Query hook fetching admin dashboard statistics from the backend.",
  "frontend/src/hooks/queries/useAdminPayoutRequests.ts": "Provides queries and mutations for retrieving and updating payout requests.",
  "frontend/src/hooks/queries/useAdminStatus.ts": "Query hook checking whether the current caller is an admin.",
  "frontend/src/hooks/queries/useCallerProfile.ts": "Hooks for fetching and saving the current user's profile via the backend actor.",
  "frontend/src/hooks/queries/useTasks.ts": "Hooks to fetch tasks periodically and create new tasks through the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind base layer and theme variables plus global styles and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up query client, and wraps the app with identity provider.",
  "frontend/src/pages/About.tsx": "Displays platform and deployment information with configuration error warnings if required environment variables are missing.",
  "frontend/src/pages/AccessDenied.tsx": "Shows an access denied message and provides a button to navigate back to the dashboard.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin statistics with loading and error states, including totals for users, earnings, active tasks, and payouts.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin panel layout with navigation, sidebar, and wrapper for admin subpages.",
  "frontend/src/pages/admin/AdminPayouts.tsx": "Displays payout requests with status badges and lets admins approve or decline them, handling loading and error states.",
  "frontend/src/pages/admin/AdminSupport.tsx": "Placeholder support page showing no tickets yet.",
  "frontend/src/pages/admin/AdminTasks.tsx": "Allows admins to create tasks and view existing ones, including form handling and validation.",
  "frontend/src/pages/admin/AdminUsers.tsx": "Placeholder user management page indicating upcoming features.",
  "frontend/src/pages/Dashboard.tsx": "Fetches and displays the user's profile with earnings, task stats, and a referral code copy feature.",
  "frontend/src/pages/Landing.tsx": "Public landing page that promotes the platform and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Notifications.tsx": "Shows a placeholder notifications panel indicating no current notifications.",
  "frontend/src/pages/Onboarding.tsx": "Handles new user profile creation with name and optional referral code submission.",
  "frontend/src/pages/Payout.tsx": "Displays payout balance, minimum withdrawal info, and placeholder payout and transaction sections.",
  "frontend/src/pages/Profile.tsx": "Shows user profile details, referral info, principal reveal, and account settings links.",
  "frontend/src/pages/Support.tsx": "Provides a placeholder support page indicating upcoming support system features.",
  "frontend/src/pages/SupportThread.tsx": "Placeholder page for viewing individual support threads.",
  "frontend/src/pages/TaskDetails.tsx": "Displays detailed info for a single task, handling loading, not found states, and submission or completion status UI.",
  "frontend/src/pages/Tasks.tsx": "Lists all tasks with status, reward, and a button to view details, showing skeletons while loading.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state metadata, including deployment notes, known issues, and pending admin‑related feature requests."
}