{
  "backend/main.mo": "Motoko canister defining task, user, payout, and admin structures with maps for storing state and admin-restricted query/update functions for stats and payout management.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in adding a UI control to reveal the authenticated user's principal.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of frontend files, mainly describing routes, components, and page behavior.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH-based color variables for light and dark themes and global styling rules.",
  "frontend/index.html": "HTML entry point that loads the React application and sets metadata and favicon.",
  "frontend/README.md": "Frontend README outlining features, tech stack, and setup instructions for the Xtask web application.",
  "frontend/src/App.tsx": "Main router configuration defining public, authenticated, and admin routes with layout and providers.",
  "frontend/src/components/AdminRoute.tsx": "Component that checks admin status and redirects unauthorized users to an access denied page.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing the top header, bottom navigation, and themed background for authenticated pages.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard handling Internet Identity login, profile fetching, and onboarding logic.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar linking to dashboard, tasks, payout, and profile sections with active-state styling.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card wrapper applying blur, transparency, borders, and custom classes.",
  "frontend/src/components/LoginButton.tsx": "Button that triggers Internet Identity login or logout and handles loading states and errors.",
  "frontend/src/components/PrincipalReveal.tsx": "Displays and optionally reveals/copies the user's principal ID with UI controls.",
  "frontend/src/components/TaskSubmissionForm.tsx": "Form for submitting task proof text and URL, currently showing a placeholder implementation notice.",
  "frontend/src/components/TextLogo.tsx": "Simple component rendering the 'XTask' text logo.",
  "frontend/src/components/TopHeader.tsx": "Fixed top navigation bar with logo, notifications, and support buttons.",
  "frontend/src/deployInfo.ts": "Loads deployment metadata such as canister IDs and site URL from environment variables.",
  "frontend/src/hooks/queries/useAdminDashboardStats.ts": "React Query hook to fetch admin dashboard statistics from the backend actor.",
  "frontend/src/hooks/queries/useAdminPayoutRequests.ts": "Provides hooks to fetch payout requests and update their statuses, with query invalidation.",
  "frontend/src/hooks/queries/useAdminStatus.ts": "Hook to determine if the current caller is an admin by querying the backend actor.",
  "frontend/src/hooks/queries/useCallerProfile.ts": "Hooks to fetch and update the current user's profile with cache invalidation.",
  "frontend/src/hooks/queries/useTasks.ts": "Hooks to fetch tasks periodically and create new tasks via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation based on identity and triggers dependent query refreshes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, persistence, and exposed identity state.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for theming plus global animations.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/About.tsx": "Displays platform details, deployment info, supported features, and limitations using GlassCard components.",
  "frontend/src/pages/AccessDenied.tsx": "Shows an access denied message with a button redirecting users to the dashboard.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin statistics with loading and error states, rendering metrics like users, earnings, tasks, and payouts.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides admin panel layout with sidebar navigation and header, wrapping admin subpages.",
  "frontend/src/pages/admin/AdminPayouts.tsx": "Displays payout requests with actions to approve or decline and handles loading and error states.",
  "frontend/src/pages/admin/AdminSupport.tsx": "Placeholder page showing support management heading and no tickets message.",
  "frontend/src/pages/admin/AdminTasks.tsx": "Allows admins to view tasks and create new ones with a form and validation.",
  "frontend/src/pages/admin/AdminUsers.tsx": "Placeholder page for user management with a coming soon message.",
  "frontend/src/pages/Dashboard.tsx": "Loads the user's profile and displays earnings, task stats, and referral info with placeholders for missing backend data.",
  "frontend/src/pages/Landing.tsx": "Public landing page with hero content and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Notifications.tsx": "Shows a placeholder notifications page indicating no notifications yet.",
  "frontend/src/pages/Onboarding.tsx": "Form for creating a new user profile, handling name and optional referral code submission.",
  "frontend/src/pages/Payout.tsx": "Displays payout balance, withdrawal requirements, and placeholder payout method and history sections.",
  "frontend/src/pages/Profile.tsx": "Shows user profile details, referral stats, principal reveal, and account settings actions.",
  "frontend/src/pages/Support.tsx": "Placeholder support page indicating upcoming support ticket features.",
  "frontend/src/pages/SupportThread.tsx": "Placeholder page for viewing individual support threads.",
  "frontend/src/pages/TaskDetails.tsx": "Displays detailed info for a single task, handling loading, not-found, and status-specific UI including submission and completion states.",
  "frontend/src/pages/Tasks.tsx": "Lists all tasks with loading skeletons and navigation to individual task details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove hash parameters for routing and session state.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and container settings for the frontend.",
  "project_state.json": "Defines the project's current scope, constraints, architecture notes, and implemented features for an Internet Computer–based tasks platform."
}